import pandas as pd


data_lst = [
    # 濁音
    ['だめ', 'だばめべ'],
    # 撥音
    ['みほん', 'みびほぼんぶ'],
    # 促音
    ['ぜったい', 'ぜべったばいび'],
    # 長音
    ['るーる', 'るぶーぶるぶ'],
    # 半濁音
    ['ぷーさん', 'ぷぶーぶさばんぶ'],
    # 捨て仮名
    ['ゎたしねぇ', 'ゎばたばしびねぇべ'],
    # 拗音
    ['ゔぃれっじゔぁんがーど', 'ゔぃびれべっじびゔぁばんぶがばーばどぼ'],
    # 文末の促音
    ['やるしかないっ', 'やばるぶしびかばなばいびっ'],
    # 文末の長音
    ['きゃんぷふぁいやー', 'きゃばんぶぷぶふぁばいびやばー'],
    # 拗音 + 長音
    ['りゅーず', 'りゅぶーぶずぶ'],
    # 記号 + 感嘆符 + 疑問符
    ['ほんとに...!?', 'ほぼんぶとぼにび...!?'],
]

test_data = pd.DataFrame(
    data_lst,
    columns=['input', 'output'],
)

test_data.to_csv('tests/test_data/test_data.csv', index=False)
