import pandas as pd


data_lst = [
    # 五十音
    ['あいうえお', 'あばいびうぶえべおぼ'],
    ['かきくけこ', 'かばきびくぶけべこぼ'],
    ['さしすせそ', 'さばしびすぶせべそぼ'],
    ['たちつてと', 'たばちびつぶてべとぼ'],
    ['なにぬねの', 'なばにびぬぶねべのぼ'],
    ['はひふへほ', 'はばひびふぶへべほぼ'],
    ['まみむめも', 'まばみびむぶめべもぼ'],
    ['やゆよ', 'やばゆぶよぼ'],
    ['らりるれろ', 'らばりびるぶれべろぼ'],
    ['わをん', 'わばをぼんぶ'],
    # 濁音
    ['がぎぐげご', 'がばぎびぐぶげべごぼ'],
    ['ざじずぜぞ', 'ざばじびずぶぜべぞぼ'],
    ['だぢづでど', 'だばぢびづぶでべどぼ'],
    ['ばびぶべぼ', 'ばばびびぶぶべべぼぼ'],
    # 半濁音
    ['ぱぴぷぺぽ', 'ぱばぴびぷぶぺべぽぼ'],
    # 促音
    ['ぜったい', 'ぜべったばいび'],
    # 長音
    ['るーる', 'るぶーぶるぶ'],
    # 捨て仮名
    ['ゎたしねぇ', 'ゎばたばしびねぇべ'],
    # 拗音
    ['ゔぃれっじゔぁんがーど', 'ゔぃびれべっじびゔぁばんぶがばーばどぼ'],
    # 文末の促音
    ['やるしかないっ', 'やばるぶしびかばなばいびっ'],
    # 文末の長音
    ['きゃんぷふぁいやー', 'きゃばんぶぷぶふぁばいびやばー'],
    # 拗音 + 長音
    ['りゅーず', 'りゅぶーぶずぶ'],
    # 記号 + 感嘆符 + 疑問符
    ['ほんとに...!?', 'ほぼんぶとぼにび...!?']
]

test_data = pd.DataFrame(
    data_lst,
    columns=['input', 'output'],
)

test_data.to_csv('tests/test_data/test_data.csv')
